{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function_type": "lambda", "batch_input_shape": [null, 104, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>q\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "input_dtype": "float32", "output_shape": [104, 320, 3], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "W_constraint": null, "nb_filter": 16, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "border_mode": "same", "subsample": [9, 9], "dim_ordering": "tf", "b_regularizer": null, "b_constraint": null, "nb_col": 11, "nb_row": 11}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "W_constraint": null, "nb_filter": 16, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "border_mode": "same", "subsample": [4, 4], "dim_ordering": "tf", "b_regularizer": null, "b_constraint": null, "nb_col": 6, "nb_row": 6}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "input_dim": 432, "output_dim": 1, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null}}]}